import  os

from utils.chat import CustomHTTPLLM

# url = "http://172.16.108.178:11451/qwen"
url = "http://localhost:11451/qwen"
projectPath = os.path.abspath("../")


# entities = "公司名称、组织名称、时间与日期、产品名称、人名、地名"
# types =["公司名称","组织名称","时间与日期","产品名称","人名","地名"]

entities = "人名、医院名称、家庭住址、婚姻状况、户籍所在地"
types =["人名","医院名称","家庭住址","婚姻状况","户籍所在地"]
docType = "电子病历"

mask_type = "遮蔽"
# mask_type = "替换"
# mask_type = "隐去"

# 脱敏格式:1、高隐私。2、同义替换。3、从脱敏披露中学习
patten = 1
# docPath = "D:/language python/GeneralNERDataMasking/datasets/小米财报2024_formal.txt"
# docPath = "D:/language python/LangChainDataMask/Output/病历1.txt"
docPath = os.path.join(projectPath,"Output","病历1.txt")
outputPath = os.path.join(projectPath,"Output")
if not os.path.exists(outputPath):
    os.makedirs(outputPath,exist_ok=True)


LLM = CustomHTTPLLM(url = url)


demo_shots = [
        ("萨哈夫说，伊拉克将同联合国销毁伊拉克大规模杀伤性武器的特别委员会继续保持合作。",["萨哈夫","说","，","伊拉克","将同","联合国","销毁","伊拉克大规模杀伤性武器","的","特别委员会","继续保持合作","。"]),
        ("马化腾是星辰科技有限公司的董事长",["马化腾","是","星辰科技有限公司","的","董事长"]),
        ("集团第三季度营业额增长率达到5个百分点",["集团","第三季度","营业额","增长率","达到","5个百分点"])
    ]

word_cut_demo = """
用户输入:萨哈夫说，伊拉克将同联合国销毁伊拉克大规模杀伤性武器的特别委员会继续保持合作。
模型输出: ["萨哈夫","说","，","伊拉克","将同","联合国","销毁","伊拉克大规模杀伤性武器","的","特别委员会","继续保持合作","。"]
用户输入: 马化腾是星辰科技有限公司的董事长
模型输出: ["马化腾","是","星辰科技有限公司","的","董事长"]
用户输入:集团第三季度营业额增长率达到5个百分点
模型输出: ["集团","第三季度","营业额","增长率","达到","5个百分点"]

"""
sensitive_info_demo = """

"""

# sensitive_info_demo_1 = """
# 用户输入:   "苹果",
# 原始语句:   "“苹果公司第三季度财报”",
# 输出: "##Yes##, 在给定的文本里面,苹果是一个公司的名字,因此它属于公司类型"
#
# 用户输入:   "4月28日",
# 原始语句:   "新华社华盛顿4月28日电（记者：翟景升）",
# 输出: "##Yes##, \"4月28日\"在原文中，4月28日属于一个具体的日期，因此它是日期的类型。"
# """

demos = """
原始语句:   "刘志刚，男性，36岁，已婚，汉族，河北承德双滦区双塔山镇大元宝山村人。",
关注的词:   "刘志刚",
输出: "##Yes##, 在给定的文本里面,刘志刚是一个人的名字,因此它属于人名类型"

原始语句:   "应利娜女31岁未婚满族河北省承德市双滦区双塔山镇",
关注的词:   "河北省承德市双滦区双塔山镇",
输出: "##Yes##, 河北省承德市双滦区双塔山镇 在原文中，河北省承德市双滦区双塔山镇属于应利娜的家庭住址，因此它是家庭住址类型。"
"""

# def makeIdentityDemo():
